.INCLUDE "..\appnotes\2313def.inc" ;ïîäêëþ÷åíèå ôàéëà ñî
;ñïåöèôèêàöèåé ðåãèñòðîâ ââîäà/âûâîäà
.DSEG
.ORG 0x60
arr: .BYTE 10
.CSEG ;ñåãìåíò êîäà
rjmp Reset ;âåêòîð ïðåðûâàíèÿ, âûçûâàåìîãî ïî ñáðîñó ìèêðîêîíòðîëëåðà
Reset: ;íà÷àëî ïðîãðàììû
ldi XH,HIGH(arr) ;óêàçàòåëü X ïðîèíèöèàëèçèðîâàí çíà÷åíèåì
ldi XL,LOW(arr) ;àäðåñà íà÷àëà ìàññèâà arr
ldi r16,10 ;çàãðóçêà â ñ÷åò÷èê öèêëà r16 ÷èñëà 10
clr r3 ;r3<-0x00
clr r5 ;r3<-0x00
 cycle:
ld r0,X+ ;êîïèðîâàíèå â r0 ñîäåðæèìîãî ÿ÷åéêè ÎÇÓ, íà êîòîðóþ
;óêàçûâàåò X ñ ïîñëåäóþùèì óâåëè÷åíèåì X íà åäèíèöó
sbrs r0,0 ;ïðîïóñòèòü ñëåäóþùèé îïåðàòîð, åñëè áèò 0 ðåãèñòðà
;r0 ðàâåí åäèíèöå
rjmp even

continue:
dec r16 ;r16<-(r16-1)
cpi r16,0x00 ;ñðàâíåíèå r16 ñ íóëåì
 brne cycle ;ïîâòîðåíèå öèêëà, åñëè íå 0
rjmp PC ;áåñêîíå÷íûé öèêë

even:
  inc r3 ;èíêðåìåíò ñ÷åò÷èêà ÷åòíûõ ÷èñåë
  sbrs r0, 1;ïðîïóñòèòü ñëåäóþùèé îïåðàòîð, åñëè áèò 1 ðåãèñòðà
;r0 ðàâåí åäèíèöå
  inc r5 ;
  rjmp continue
